$(function() {

  //****************************************************************************************************
  //
  // .. SCROLL TO
  //
  //****************************************************************************************************
  $('a[data-scroll="true"]').click(function() {
    var
      anchor = $(this).attr('href'),
      offset = $(this).data('offset') || 0,
      destination = $(anchor).offset().top - offset;
    
    $('html, body').animate({scrollTop: destination}, 500);
    
    return false;
  });



  //****************************************************************************************************
  //
  // .. Autocomplete
  //
  //****************************************************************************************************
  var availableTags = [
      "Москва",
      "Воронеж",
      "Екатеринбург",
      "Краснодар",
      "Астрахань",
      "Белгород",
      "Волгоград",
      "Калининград",
      "Липецк",
      "Нижний Новгород",
      "Новосибирск",
      "Омск",
      "Оренбург",
      "Ростов на Дону",
      "Самара",
      "Саратов",
      "Сочи",
      "Сургут",
      "Тольяти",
      "Тула",
      "Пермь",
      "Рязань"
  ];
  $('#autocomplete').autocomplete({
    source: availableTags
  });  


});